{
    "architectures": ["Qwen2_5_VLForConditionalGenerationWithVGGT"],
    "model_type": "qwen2_5_vl",
    "auto_map": {
      "AutoModelForVision2Seq": "qwenmem.modeling_qwen2_5_vl_with_vggt.Qwen2_5_VLForConditionalGenerationWithVGGT"
    }
  }